#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "e3d7307003c2ff32d9e1373938624458" -> "e85cc65f62254ad6796482384c6a336a"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "b55493ad8482498cd57b63ee989e2b95" -> "8a1c7fe1f6b44f7f500e808d3a493a21"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be created
  + resource "aws_s3_bucket_object" "add_tag_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "813bd5856d0fc0aa013425f8e265db56"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/add_tag_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/add_tag_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "d6c5a5c5759a845b7cedf02761249070" -> "d7c641e2e105e788b403199ea3d4728b"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "9a030cbc5d3187e39b003fd7f2aabaf9" -> "4e25a7a124444c1d98373803bd954991"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "86376ed65e4772cec0ce8694af17da57" -> "9b0ef4d5ea69d8dfa638aea67b172cb3"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "989d26a9c762ae67725f2da3aa5f93bb" -> "731d616550d37b017e00d315d035cf0a"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "1d436d6787cde496f3aa2be6ec5cec13" -> "db1c03a2b9187adae6781ea225c8c93b"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "6d7adfd7eb2bd3ac125b71e771c9db3c" -> "5e02d8178a20ea16941aae280db1ec62"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "97068fdd4005e4d6c95bb89c684da6fa" -> "0e43dcd13783803b20d2bb83b11cb55a"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "3888241f70c5d2b5245bd906e0787d0f" -> "73d056804b3cf7b7a2c1680a1e6b298f"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be created
  + resource "aws_s3_bucket_object" "delete_tags_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "aa718f20813ab7632cbd99ff76ab37f9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/delete_tags_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/delete_tags_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "aceebfdf40bafa8264f2e2d3f46a8575" -> "7169dad66775637e1bcb77cf528370a9"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "b306572900d203c95b162189053d694b" -> "b154dabbcee1c0cbfa9098daa2b339a0"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "39b748b49362e65b47f7aa3337e87f18" -> "0bf1c6ae4d35e75e3d1b5f5567b04210"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "23ba45bb0d3cd0c14bca50cc73c9163c" -> "6b6f7e1e368fc34f27f7abcea7942b26"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "a0aeeb9ac89f6d4edbca3ec1061c836d" -> "7e53013482166960341bbeb2b5410136"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "f0756313784d5e63215b122cdd795efa" -> "7ce0a84c8b59614216b5e7a207550c0c"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "5248eaabc37af3fd53e5b09bd7dad30b" -> "2f37857a7c618ebbcb46cc3ca106b7c4"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c06cbd8bb27d928adaeb78a7542bcf0a" -> "932f1ec162271d1c57c0aca58f3112a9"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "f7b1ba80cc170b7262829f2af8bcdafe" -> "0bb70b718b93712aa104ed409363503c"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "22da3ed5064edfbc9ef0c6b6ffaf7e74" -> "af79329205440477662ff6508e8c558a"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "58462de39bd692ca8765ca9a129b8bd4" -> "f2d47d6358b61de3e26361ed3e8d3c69"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "eadf60d5ee4262073c06cbdaf2ce1f42" -> "1b1979ae8fe2ef0d1f6275a0a58602df"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "84d083f2b0999c391b7df628a5ec36e2" -> "c4f51db63d41a8f9bebb0967c6e98204"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "510fb40b6200816909009a8517b4ed85" -> "a27c5a4bf99419abbb8bdcac5ef2077b"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "6ab248cf39ea7512441273b842ecaf1f" -> "bd35eb47b7cf3f5a8c579f621dc43997"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "9a37ae7609fa8a805472b4f07d0fa2f1" -> "2c9c99424c1c9f3ecfd9d2fe1779b313"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "95c467d1517cf63292fa04dc773f0d8f" -> "05eb8af564a01aeca783efdea2d124b2"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be created
  + resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "f120d4eabfaab1921cd9ee0b47422fa6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/get_tags_by_company_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/get_tags_by_company_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "d1045d8f6402d750613b9704f77391df" -> "ee96c9c9955b871cec42b0f1dbb8f3fa"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "7a0f6725a3e3ced8b805266dbc1d2575" -> "9c03cbd5ae0f3e27bfc664a6306cef76"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "1e0bb79791f46adeccf05c4f65527a5e" -> "c24975074200c07831fbfd455ed69e2b"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "5814eedded9fe655b60e6d58e8c31b97" -> "18a1914d5729405364cc6bd985730b78"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "b5b3c834dec9011b5eb6018af0b1b09b" -> "699a1380e6ca5b8ac3c0304bc55082cf"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "39fd90b2905335812c3c98dffe2b870f" -> "97688ad7e315ccbde0b51505d6defaa9"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "affdd8ab0d2eb1fdb0e3e7d29fb99593" -> "6e9772f8677398f3281ca443ccbfe9e6"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "d1a147fff0e4c1127595f020c1ee6069" -> "ccfd0438609146984c4e30d1f7dcd63c"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be created
  + resource "aws_s3_bucket_object" "update_tags_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "8a8a1fb620d940dd711c3843d59a4050"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/update_tags_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/update_tags_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "9fb6decb622c0f56e5301c64ba56e152" -> "f408f431b387fef48675e6e4f7dd9fd6"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "927cb2352ebd796fb597b178dc197b68" -> "aed1bc5405aa20511405f9b7d796c651"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "ef816ab7733ee155c0f58f8242ba8f52" -> "12d17ec03dc463717fa44a0f50322289"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "MSHwkZl9+MRNjpqS2Mhiexw9kt7kXEY/G39IQu1v5xo=" -> "+G+1iffmO/W9TFfkLIuUMpOCDPG23FVuuNSmk4W+GbQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "fsfLINYfGWfngVfi3UUKhs121EmNcD2AcFl2f3rUCyY=" -> "LUEM2KrL5UeeKkb5SIWI5zJ8GP/gYdSJ6/ZdKojyDko="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be created
  + resource "aws_lambda_function" "add_tag_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_add_tag_lambda_function"
      + handler                        = "add_tag_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/add_tag_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "BipV9xdwfTOEXLkskEYAY4BC2egniqhW2v0cRzkc+hU="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "EiJGirJmFr2+wtEcSzF6/MclnHlbnoxoFLerEp0D9V0=" -> "dGNLuxO1oDqmEtiXfMZzpGV8jLH/g32q2uaoZyS4m84="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "PwNIzWD8sggGLSFSyAZ767MROB1XR2YlWMCsZM65MKE=" -> "21ssq/HMB2mEXJKr0O8QbwphGUSdhVAMsUoAmdOa7b8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "OWas56QxAggrHI0sbKJ3k1lBmQYKSh+vzHPQm4yW6Rs=" -> "Qw4lq7iLNPkLIoGKkzrLWE8Cqf7nwdXo6J6btpHv2Og="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "KSP+RWS+UvxXzk+Fwa4zrc92EwfEa9NpNXibuaJbthk=" -> "vO+ovKU6yP2H1v3PGlPmKXoYqVYMlz3s1VmKMssC/Ik="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "3fJhm/ji9Q/VT126SEKt1I61mXxGlnn1tSOh1K1eNbw=" -> "FMJ8xZ0dEiaG46Kt0qlJYql16hhLoMjdWrbUcgEbvMQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "JGkxAGocywI+vPrFRppaHmxM6FDGWT1AJgd6mYVzePw=" -> "tuQxV0Jh44ZTwGCSL0eeHvlbi9+HkeRmMQtdL3NKwNE="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "ovZzTt/RhHfCogIdi4SKLAX19kBpQGEAVq8/YfpHeBg=" -> "bUjnMa+AjsNiefu6ucun8PyaJVGvbmceIZXPmJIsXqU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "ry5IZhvZQXlsJSOb+rVNPeJmfoagC68qe+iGx+h7+ck=" -> "ek5frw2vfAUo3r3DnY8X7bPZwqaom5YkHa5KMrhAhyY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be created
  + resource "aws_lambda_function" "delete_tags_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_delete_tags_lambda_function"
      + handler                        = "delete_tags_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/delete_tags_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "bmkxO1ROXkVy+P4By8+pFQlT1dqK3DlRyZ6eExsRPbY="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "BwEpx+NzFjQ05yRaudNnosF+Zp27iLrbUTvFNa2g2HY=" -> "OBMNsw6bcY1RuT/rhxvr0+tiJ1r90cqpFKckPwBPYlI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "wb5UPoMGzbBmEtFhlVFdgtrw81ObpG+zMLW6UjLsX44=" -> "vZG3upKbGTfk4+1iTpOkGJVGJ5RAw++HNOOccH319vo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "jkbjS3zP9yl8I9lVPjrKniqMXqmbmr7D7mMUr2xabKg=" -> "T4q3UxMBC0KQ+vx0u7QbMK9kN6pnB/oHihiiMxWcdCY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "2dUxeSuC3HRd5ckJNOBJHmLxVfCuxqddavacHA/Yy08=" -> "0v7MX1G+QRhWAEoYZlm4d+eV5ypnalfa0116UpBOgwI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-14T15:00:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "C2zF2PDX6Gdbi6GzzrpaQWq9F9rbX7FYJUxXtmcfHGs=" -> "Ckz0DZCG+86jKdL82EBaaQ97FkqFI3DIWHA5mHBCysA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:23.086+0000" -> (known after apply)
      ~ source_code_hash               = "st6ZxvECvQ2utv5Ym+hqZmd5ydh/HDDR+0VTS01ZzVk=" -> "tGVGeW/OgSxIdFkbzpfnNwktgbvWHiAGu297za8XVrY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "agarURpwJ5k2XqADb2zGp1Svb1CUcnlXvEevh4lzq5M=" -> "rHsYCjwyuev3S2QuU9cV858pmKDInZf99I3qGe1k0LY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "RdhngHElLOKzpEFlx/hto/gJ/6VXhlBLrUZvBIk1qVw=" -> "7wquJAPedoCHEDFCOi4OhJNYS0uMZ+2UU9jqQdNKcV8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "4W43Fu7SEZzzoH+9gGfHejos6UT69raPGBVbicN4jiI=" -> "IAzKb5mEpvaUh5CTebBXaDkp8gQzcBRJ76hmo0EcVpI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "O2NJo2BUVBOMMcKEsYG6ylKuUsj+YWPYOff38BdEwWY=" -> "j5aT6aIgpNGr9fsWb7rm01+iMc6rc5i9dNQXLOgWTqs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "IUR2trABaJh8lZcWQI0tMhq5P0tgt5Wni3sH8PnqwsI=" -> "y2wBWjpM38OtOeVBzFSr5pUv6/8dbXkz0uQkvVOFxMw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "wsirE8StrIGEO00/oLiw0pHZpTew2LO4HvPOc1KzEUI=" -> "RJEWAYucvRYNqfu3UoAyLZJmoqeMor977dWVUGwpcgg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "2dFBbw61xP8cr55rQ1tdXgKZV1mlW+TQa08rWUHekaQ=" -> "LQfMBB+q2kb6Mn3USJyIX2Fwl2nhtWxV1Mamj0k/71E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "jhVmgieH63sjb0Q+eIwSozxDMZGyBWKkcpzaLVgUy2s=" -> "H9eUG70BAHwFurVh1NcaPbrKkRd0suB792Z6OGpq6tQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "rfSETxWmIDCxE3Sz/yT21QGPIZnlhjQXX6GI/nP1dEA=" -> "qL/598iWKu9OhE1YlaQZPViIb2tBowdHqOoZBdjLHIo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "QAL28N0rR8pAnoAB76hZzYjw7BhNSbW2UDRQauCQuUM=" -> "4wYZStb7+8wa1j3uPITO6IaCeF4QO8pIeD77RN1Q6f4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "yL1o7Y+IUnHT8n9GHwKRJ029sG4FJuHLF8ISeXLz/lY=" -> "sbrYMMmq1Zz/8qeM7qDRinjoW4w5vfyKm2ijGGLaGX8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be created
  + resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_get_tags_by_company_lambda_function"
      + handler                        = "get_tags_by_company_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/get_tags_by_company_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "wz8jr4PNlB0f2Qm45gsuPF3EKaO3DkXwyqELz6e1y54="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "UVQUWalksA8snMWPP2FsSL79LfGNvnlRXMzK/vT7B6g=" -> "8j5ekZYjK1ud90I4JoDENw8XvWT5T/1ekCbyTKa6HYw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "VoUwIMDWBHtANVZyFbrzuBCDBfVlWAZ1vF1CK37qsy4=" -> "ijQ/Bw/pIeJmepCU1Adfk5WYWzFsEnR71AG5IYnDgKo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "P+keut76Dp0S5kWaW1p6Iz12hm2PLL76zhifeN31TH8=" -> "5a9Wd+r7VE0h3pgYzvzW3ATATgZwn/SbpwcZusBq0/A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "QNNnoK51BPfY6JyD5N0qzcNt8I0nIi/FFBWUbtHDU9s=" -> "zFnLuWOjL4YN3n0t1poYVRvyWK0smLIcOWQw4wNwFdA="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "dHw5z7IDVnNO7/UyCpf0P/3j9QRvGwKznALj0kFqDBc=" -> "ZIpTtPHAQe7Zj95Ijp3LKbTXc7z9TY81hVNxsVaZPZM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "YNWa76kJ9nR8/gCXgIHfhyCa1erdNrfm0AgLINnRLUM=" -> "7VQZSff3K60jnwu8O7BdpqdbquctfmnKQ9lwxq7Qhys="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "QM2rVbEUuCEL+fjQGrwXHKpkLZwK78RstWlLEKrcV2k=" -> "9EmbE+6fQkoP7YcXV2xZdpFf20Hkdmad9YficPMl21w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be created
  + resource "aws_lambda_function" "update_tags_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_update_tags_lambda_function"
      + handler                        = "update_tags_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/update_tags_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "numXysbUac6CqSo7BsTFNqGUkE9WkYl22sc/MGwzrvo="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "EJ9bT0pgeDx6T+PvjnVlrfPrdocgEZfOltgKMKENKb4=" -> "ecmJsb4o9EjVdMI2TeWJevO18n2i8dMe6osix7jlKYs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "WRDlzaQQbkncPCuEGuCZBfdI4ytbYQuXlThbYewRRHE=" -> "YGDhuR9150F0X+FLMDf+iB2OHlLoc/UiEMLRXjQiGRg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "W8BDS1NQKBQbbQNaA90zpZc9O6HIZBA792czWdepkJE=" -> "Ja3uRIGGEEXMsr6vDGfiDsZkXD/S6+yz/CVNpVoXVpg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-11T22:27:35Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "ret4qs" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-11T22:27:32Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.add_tag_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "add_tag_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_add_tag_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.logs.aws_cloudwatch_log_group.delete_tags_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "delete_tags_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_delete_tags_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.logs.aws_cloudwatch_log_group.get_tags_by_company_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_tags_by_company_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_get_tags_by_company_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.logs.aws_cloudwatch_log_group.update_tags_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "update_tags_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_update_tags_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.add_tag_integration will be created
  + resource "aws_api_gateway_integration" "add_tag_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "jp8jt7"
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_integration.delete_tags_integration will be created
  + resource "aws_api_gateway_integration" "delete_tags_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "DELETE"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "jp8jt7"
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_integration.get_tags_by_company_integration will be created
  + resource "aws_api_gateway_integration" "get_tags_by_company_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_integration.update_tags_integration will be created
  + resource "aws_api_gateway_integration" "update_tags_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PUT"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "jp8jt7"
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.add_tag_method will be created
  + resource "aws_api_gateway_method" "add_tag_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = "jp8jt7"
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_method.delete_tags_method will be created
  + resource "aws_api_gateway_method" "delete_tags_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "DELETE"
      + id               = (known after apply)
      + resource_id      = "jp8jt7"
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_method.get_tags_by_company_method will be created
  + resource "aws_api_gateway_method" "get_tags_by_company_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_method.update_tags_method will be created
  + resource "aws_api_gateway_method" "update_tags_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "PUT"
      + id               = (known after apply)
      + resource_id      = "jp8jt7"
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_resource.tags_by_company will be created
  + resource "aws_api_gateway_resource" "tags_by_company" {
      + id          = (known after apply)
      + parent_id   = "hper4a"
      + path        = (known after apply)
      + path_part   = "tags"
      + rest_api_id = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-11T22:29:18Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:log
```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*